
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/mirror-kt/infra/actions/runs/7853513532)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infra/infra/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infra/infra

To view this run in a browser, visit:
https://app.terraform.io/app/mirror_kt/infra/runs/run-hYMZTeFz2sHzFVev

Waiting for the plan to start...

Terraform v1.5.2
on linux_amd64
Initializing plugins and modules...
cloudflare_record.keybase: Refreshing state... [id=8a2a49c6ca25d3cab8be62f0345c946f]
cloudflare_record.mail: Refreshing state... [id=dc6ab257f55541903793b9994ca09088]
cloudflare_record.spf: Refreshing state... [id=435b0c4eb777f08bca3af5956f574bab]
cloudflare_record.dmarc: Refreshing state... [id=65697af76fae224a6b798b45eac1a5e3]
cloudflare_record.root: Refreshing state... [id=f9eda77b4bca441d067375f89c3b2e82]
cloudflare_record.github_pages_challenge: Refreshing state... [id=98559ec5f45395e378ff8e95c10f893f]
cloudflare_record.dub_sh: Refreshing state... [id=468772b0ad75358effdd590a82ebb903]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.bsky_record will be created
  + resource "cloudflare_record" "bsky_record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_atproto"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "did=did:plc:r74f3l5bzuodnjekrf364t2v"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

cloudflare_record.bsky_record: Creating...
cloudflare_record.bsky_record: Creation complete after 1s [id=6c396e5db88508e37738feb11bb49204]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.


```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":15,"Program":"tfcmt","SHA1":"ea872f4611663ca49871c59f37b27d6fb06aa368","Vars":{},"WorkflowName":"Terraform"} -->